{"class_name": "Model", "config": {"name": "apple_model", "layers": [{"name": "headline_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 5, 9, 300], "dtype": "float32", "sparse": false, "name": "headline_in"}, "inbound_nodes": []}, {"name": "condense_each_headline", "class_name": "Lambda", "config": {"name": "condense_each_headline", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAkAAABDAAAAc1IAAAB0AIMAfQF4PHQBfABqAmQBGQCDAUQAXSp9AnwBagN0\nBHwAZABkAIUCfAJkAGQAhQJkAGQAhQJmBBkAgwGDAQEAcRZXAHQFZAFkAo0BfAGDAVMAKQNO6QEA\nAAApAdoEYXhpcykG2gRsaXN02gVyYW5nZdoFc2hhcGXaBmFwcGVuZNoUaGVhZGxpbmVfY29uZGVu\nc2VyX2faC0NvbmNhdGVuYXRlKQPaBmlucHV0c9oEb3V0c9oBaakAcgwAAAD6R0M6L1VzZXJzL2dh\ncnlnL1dvcmsvZmluYW5jZS1wcm9qZWN0L21sL3Byb3RvdHlwaW5nL21vZGVsL2J1aWxkX21vZGVs\nLnB52gphcHBseV9lYWNoHwAAAHMIAAAAAAIGAhQBKgI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["headline_in", 0, 0, {}]]]}, {"name": "price_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 5, 1], "dtype": "float32", "sparse": false, "name": "price_in"}, "inbound_nodes": []}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "axis": -1}, "inbound_nodes": [[["condense_each_headline", 0, 0, {}], ["price_in", 0, 0, {}]]]}, {"name": "main_lstm", "class_name": "LSTM", "config": {"name": "main_lstm", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 10, "activation": "relu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "main_dropout", "class_name": "Dropout", "config": {"name": "main_dropout", "trainable": true, "rate": 0.4, "noise_shape": null, "seed": null}, "inbound_nodes": [[["main_lstm", 0, 0, {}]]]}, {"name": "main_dense", "class_name": "Dense", "config": {"name": "main_dense", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["main_dropout", 0, 0, {}]]]}, {"name": "reshape_2", "class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["main_dense", 0, 0, {}]]]}], "input_layers": [["headline_in", 0, 0], ["price_in", 0, 0]], "output_layers": [["reshape_2", 0, 0]]}, "keras_version": "2.2.0", "backend": "tensorflow"}